Revit 2027 API
IFCExtrusionCreationData.ScaledLength Property
 The length of the extrusion, scaled to the units of export.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ScaledLength { get; set; }
Public Property ScaledLength As Double
	Get
	Set
public:
property double ScaledLength {
	double get ();
	void set (double value);
}
member ScaledLength : float with get, set
Property Value
Double
 Zero if the length has never been set on this object.
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace